In [69]:
import pandas as pd

In [70]:
df=pd.read_csv('../artifacts/data_cleaned.csv')
df.head()

,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Type of ownership,Industry,Sector,job_simp,...,ml_yn,dl_yn,ai_yn,python_yn,sql_yn,tool_yn,cloud_yn,Size_Upper,Age,Revenue_Upper
0,"Lead Data Scientist, India - BCG X",6*100000 – 9*100000,Locations: Mumbai | Gurgaon\nWho We Are\nBosto...,4.2,Boston Consulting Group,Gurgaon,Company - Private,Business consulting,Management and consulting,data scientist,...,0,0,0,0,0,0,0,10000,61.0,10 000
1,Senior Machine Learning Engineer,8*100000 – 10*100000,If you need assistance during the recruiting p...,3.8,Expedia Partner Solutions,Gurgaon,Company - Public,Internet & Web Services,Information Technology,mle,...,1,0,0,0,0,0,0,10000,28.0,10 000
2,Data Scientist,9*100000 – 10*100000,.\nPurpose of the role\nTo use innovative data...,3.9,Barclays,Chennai,Company - Public,Banking & Lending,Finance,data scientist,...,1,0,0,0,0,0,0,10000,334.0,10 000
3,Python Data Scientist/Analyst,25*100000 – 36*100000,"Bachelor’s/Master’s degree in Engineering, Com...",NaN,Excellent Opportunity,Remote,NaN,NaN,NaN,data scientist,...,0,0,0,1,0,0,0,NaN,NaN,NaN
4,Python & Data Science Trainer,12*1000 – 20*1000*12,Responsible for delivering workshops & trainin...,NaN,IPCS Global solutions pvt ltd,India,NaN,NaN,NaN,na,...,1,1,0,1,0,0,0,NaN,NaN,NaN

In [71]:
# job description length
df['desc_len'] = df['Job Description'].apply(lambda x: len(x))
df['desc_len']

0       937
1      1438
2       522
3       552
4       725
       ...
792     659
793     449
794     926
795     873
796     665
Name: desc_len, Length: 797, dtype: int64

In [72]:
df.head()

,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Type of ownership,Industry,Sector,job_simp,...,dl_yn,ai_yn,python_yn,sql_yn,tool_yn,cloud_yn,Size_Upper,Age,Revenue_Upper,desc_len
0,"Lead Data Scientist, India - BCG X",6*100000 – 9*100000,Locations: Mumbai | Gurgaon\nWho We Are\nBosto...,4.2,Boston Consulting Group,Gurgaon,Company - Private,Business consulting,Management and consulting,data scientist,...,0,0,0,0,0,0,10000,61.0,10 000,937
1,Senior Machine Learning Engineer,8*100000 – 10*100000,If you need assistance during the recruiting p...,3.8,Expedia Partner Solutions,Gurgaon,Company - Public,Internet & Web Services,Information Technology,mle,...,0,0,0,0,0,0,10000,28.0,10 000,1438
2,Data Scientist,9*100000 – 10*100000,.\nPurpose of the role\nTo use innovative data...,3.9,Barclays,Chennai,Company - Public,Banking & Lending,Finance,data scientist,...,0,0,0,0,0,0,10000,334.0,10 000,522
3,Python Data Scientist/Analyst,25*100000 – 36*100000,"Bachelor’s/Master’s degree in Engineering, Com...",NaN,Excellent Opportunity,Remote,NaN,NaN,NaN,data scientist,...,0,0,1,0,0,0,NaN,NaN,NaN,552
4,Python & Data Science Trainer,12*1000 – 20*1000*12,Responsible for delivering workshops & trainin...,NaN,IPCS Global solutions pvt ltd,India,NaN,NaN,NaN,na,...,1,0,1,0,0,0,NaN,NaN,NaN,725

In [73]:
df.describe()

,Rating,avg_salary,ml_yn,dl_yn,ai_yn,python_yn,sql_yn,tool_yn,cloud_yn,Age,desc_len
count,532.000000,7.970000e+02,797.000000,797.000000,797.0,797.000000,797.000000,797.0,797.0,433.000000,797.000000
mean,4.090038,1.407990e+06,0.210790,0.042660,0.0,0.209536,0.041405,0.0,0.0,84.323326,907.585947
std,0.363228,1.229272e+06,0.408126,0.202216,0.0,0.407233,0.199351,0.0,0.0,91.397493,999.114971
min,3.400000,1.200000e+05,0.000000,0.000000,0.0,0.000000,0.000000,0.0,0.0,5.000000,213.000000
25%,3.900000,5.000000e+05,0.000000,0.000000,0.0,0.000000,0.000000,0.0,0.0,18.000000,548.000000
50%,4.100000,1.300000e+06,0.000000,0.000000,0.0,0.000000,0.000000,0.0,0.0,57.000000,660.000000
75%,4.500000,1.900000e+06,0.000000,0.000000,0.0,0.000000,0.000000,0.0,0.0,135.000000,926.000000
max,4.700000,6.100000e+06,1.000000,1.000000,0.0,1.000000,1.000000,0.0,0.0,334.000000,5488.000000

In [74]:
df.columns

Index(['Job Title', 'Salary Estimate', 'Job Description', 'Rating',
       'Company Name', 'Location', 'Type of ownership', 'Industry', 'Sector',
       'job_simp', 'seniority', 'avg_salary', 'ml_yn', 'dl_yn', 'ai_yn',
       'python_yn', 'sql_yn', 'tool_yn', 'cloud_yn', 'Size_Upper', 'Age',
       'Revenue_Upper', 'desc_len'],
      dtype='object')

In [75]:
df.dtypes

Job Title             object
Salary Estimate       object
Job Description       object
Rating               float64
Company Name          object
Location              object
Type of ownership     object
Industry              object
Sector                object
job_simp              object
seniority             object
avg_salary           float64
ml_yn                  int64
dl_yn                  int64
ai_yn                  int64
python_yn              int64
sql_yn                 int64
tool_yn                int64
cloud_yn               int64
Size_Upper            object
Age                  float64
Revenue_Upper         object
desc_len               int64
dtype: object

In [76]:
num_features = ['Rating','avg_salary', 'ml_yn', 'dl_yn', 'ai_yn','python_yn', 'sql_yn', 'tool_yn', 'cloud_yn', 'Size_Upper', 'Age','Revenue_Upper', 'desc_len']
cat_features = ['Company Name', 'Location', 'Type of ownership', 'Industry', 'Sector', 'job_simp', 'seniority']

In [77]:
for col in num_features:
    df[col] = pd.to_numeric(df[col], errors='coerce')

for col in cat_features:
    df[col] = df[col].astype('category')

In [78]:
df.dtypes

Job Title              object
Salary Estimate        object
Job Description        object
Rating                float64
Company Name         category
Location             category
Type of ownership    category
Industry             category
Sector               category
job_simp             category
seniority            category
avg_salary            float64
ml_yn                   int64
dl_yn                   int64
ai_yn                   int64
python_yn               int64
sql_yn                  int64
tool_yn                 int64
cloud_yn                int64
Size_Upper            float64
Age                   float64
Revenue_Upper         float64
desc_len                int64
dtype: object

In [79]:
df.isna().sum()

Job Title              0
Salary Estimate        0
Job Description        0
Rating               265
Company Name           0
Location               0
Type of ownership    265
Industry             265
Sector               265
job_simp               0
seniority              0
avg_salary             0
ml_yn                  0
dl_yn                  0
ai_yn                  0
python_yn              0
sql_yn                 0
tool_yn                0
cloud_yn               0
Size_Upper           298
Age                  364
Revenue_Upper        696
desc_len               0
dtype: int64

In [80]:
# Fill missing values in numeric columns with the mean
for col in num_features:
    df[col].fillna(df[col].mean(), inplace=True)

# Fill missing values in categorical columns with the mode
for col in cat_features:
    df[col].fillna(df[col].mode()[0], inplace=True)

In [81]:
df.isna().sum()

Job Title            0
Salary Estimate      0
Job Description      0
Rating               0
Company Name         0
Location             0
Type of ownership    0
Industry             0
Sector               0
job_simp             0
seniority            0
avg_salary           0
ml_yn                0
dl_yn                0
ai_yn                0
python_yn            0
sql_yn               0
tool_yn              0
cloud_yn             0
Size_Upper           0
Age                  0
Revenue_Upper        0
desc_len             0
dtype: int64

In [82]:
df[['avg_salary','Rating','Size_Upper', 'Age', 'desc_len']].corr()

            avg_salary    Rating  Size_Upper       Age  desc_len
avg_salary    1.000000 -0.087381    0.175013  0.158906  0.027654
Rating       -0.087381  1.000000   -0.258953 -0.184949  0.026420
Size_Upper    0.175013 -0.258953    1.000000  0.533354  0.266144
Age           0.158906 -0.184949    0.533354  1.000000  0.174343
desc_len      0.027654  0.026420    0.266144  0.174343  1.000000

In [83]:
df=df.drop(['Job Title', 'Salary Estimate', 'Job Description'],axis=1)

In [84]:
df.head()

,Rating,Company Name,Location,Type of ownership,Industry,Sector,job_simp,seniority,avg_salary,ml_yn,dl_yn,ai_yn,python_yn,sql_yn,tool_yn,cloud_yn,Size_Upper,Age,Revenue_Upper,desc_len
0,4.200000,Boston Consulting Group,Gurgaon,Company - Private,Business consulting,Management and consulting,data scientist,senior,1500000.0,0,0,0,0,0,0,0,10000.000000,61.000000,25.0,937
1,3.800000,Expedia Partner Solutions,Gurgaon,Company - Public,Internet & Web Services,Information Technology,mle,senior,1800000.0,1,0,0,0,0,0,0,10000.000000,28.000000,25.0,1438
2,3.900000,Barclays,Chennai,Company - Public,Banking & Lending,Finance,data scientist,na,1900000.0,1,0,0,0,0,0,0,10000.000000,334.000000,25.0,522
3,4.090038,Excellent Opportunity,Remote,Company - Private,Information Technology Support Services,Information Technology,data scientist,na,6100000.0,0,0,0,1,0,0,0,5443.687375,84.323326,25.0,552
4,4.090038,IPCS Global solutions pvt ltd,India,Company - Private,Information Technology Support Services,Information Technology,na,na,252000.0,1,1,0,1,0,0,0,5443.687375,84.323326,25.0,725

In [85]:
from sklearn.preprocessing import StandardScaler

# Initialize the StandardScaler
scaler = StandardScaler()

# Fit and transform the numeric features
df[['Rating','Size_Upper', 'Age', 'desc_len']] = scaler.fit_transform(df[['Rating','Size_Upper', 'Age', 'desc_len']])

In [86]:
from sklearn.preprocessing import OneHotEncoder

# Initialize OneHotEncoder
onehot_encoder = OneHotEncoder(sparse=False, drop='first')
# Fit and transform the categorical features
encoded_features = onehot_encoder.fit_transform(df[cat_features])

# Create a DataFrame with the encoded features
encoded_df = pd.DataFrame(encoded_features, columns=onehot_encoder.get_feature_names_out(cat_features))

# Concatenate with the original DataFrame
df = pd.concat([df.drop(columns=cat_features), encoded_df], axis=1)

c:\Users\sathv\anaconda3\envs\myenv\lib\site-packages\sklearn\preprocessing\_encoders.py:975: FutureWarning: `sparse` was renamed to `sparse_output` in version 1.2 and will be removed in 1.4. `sparse_output` is ignored unless you leave `sparse` to its default value.
  warnings.warn(

In [87]:
df.head()

,Rating,avg_salary,ml_yn,dl_yn,ai_yn,python_yn,sql_yn,tool_yn,cloud_yn,Size_Upper,...,Sector_Information Technology,Sector_Management and consulting,Sector_Manufacturing,Sector_unknown,job_simp_data scientist,job_simp_manager,job_simp_mle,job_simp_na,seniority_na,seniority_senior
0,3.708916e-01,1500000.0,0,0,0,0,0,0,0,1.177840e+00,...,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0
1,-9.782662e-01,1800000.0,1,0,0,0,0,0,0,1.177840e+00,...,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0
2,-6.409768e-01,1900000.0,1,0,0,0,0,0,0,1.177840e+00,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
3,-2.995732e-15,6100000.0,0,0,0,1,0,0,0,2.351109e-16,...,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
4,-2.995732e-15,252000.0,1,1,0,1,0,0,0,2.351109e-16,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0,0.0